Remaining string handling query 
1. Trim
2. pad
3. left and right
4. replace
5. instr (instring)
6. reverse
7. format

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
use customer_det;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
select*from CustomerData;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'customer_det.customerdata' doesn't exist
[SQL: select*from CustomerData;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
11 rows affected.

[('company',),
 ('customer_det',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('rohi_proj',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('uber_det',),
 ('world',)]

In [8]:
%%sql
use customer_det;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [9]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [10]:
%%sql
use test;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [11]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('customerdata',), ('customertransactions',), ('demo',)]

In [12]:
%%sql
select*from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '98765', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '98765', None, Decimal('3000.00')),
 (6, 'Nithesh', 'nk@gmail.com', '8765449076', 'Chennai', Decimal('4000.00'))]

Trim is all about how we are removing the extra space from the db , there are 2 types in it
1. rtrim - trims right
2. ltrim - trims left

In [17]:
%%sql
select
trim('   chennai   ') as trimmed_city

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'rtrim('chennai   ') as r_trimmed_city
ltrim('   chennai') as l_trimmed_city' at line 3
[SQL: select
trim('   chennai   ') as trimmed_city
rtrim('chennai   ') as r_trimmed_city
ltrim('   chennai') as l_trimmed_city]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [18]:
%%sql
select
ltrim('   chennai') as l_trimmed_city

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('chennai',)]

PADDING - it fills the space with mentioned sign or charcter , it requires  3 arguments , column name , number of characters , the charcter that
fills the empty remaining space , it is also 2 types
 1.lpad
 2.rpad

In [26]:
%%sql
select
RPAD(address,15, '*' )  as padded_names
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Chennai********',),
 ('Bangalore******',),
 ('Hyderabad******',),
 ('Mumbai*********',),
 (None,),
 ('Chennai********',)]

In [27]:
%%sql
select
lpad(address,15, '*' )  as padded_names
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('********Chennai',),
 ('******Bangalore',),
 ('******Hyderabad',),
 ('*********Mumbai',),
 (None,),
 ('********Chennai',)]

Replace is about replacing the existing object with new , it requires 3 arguments , one is column name and 2 is about 
object that is existing , 3rd the object should be replaced

In [28]:
%%sql
select
replace(email,'example','gmail') as replaced_values
from customerdata;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('ravi@gmail.com',),
 (None,),
 ('arjun@gmail.com',),
 (None,),
 ('karthik@gmail.com',),
 ('nk@gmail.com',)]

INSTRING - this will help us to count the position or an word charcter repeatation

In [29]:
%%sql
select
instr(email,'o') as count_of_word
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[(15,), (None,), (16,), (None,), (18,), (11,)]

left & right - it will likely return the characters  from left to till char and also right vice versa|

In [31]:
%%sql
select
left(email,5) as few_char_from_left
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('ravi@',), (None,), ('arjun',), (None,), ('karth',), ('nk@gm',)]

In [32]:
%%sql
select
right(email,5) as few_char_from_right
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('e.com',), (None,), ('e.com',), (None,), ('e.com',), ('l.com',)]

REVERSE - it is used to reverse the entire str

In [42]:
%%sql
select
Reverse(email) as reve
from customerdata;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('moc.elpmaxe@ivar',),
 (None,),
 ('moc.elpmaxe@nujra',),
 (None,),
 ('moc.elpmaxe@kihtrak',),
 ('moc.liamg@kn',)]

Format- helps to make values as decimal seperated such as, amount etc..

In [43]:
%%sql
select
format(8000000,2) as formatted_number
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('8,000,000.00',),
 ('8,000,000.00',),
 ('8,000,000.00',),
 ('8,000,000.00',),
 ('8,000,000.00',),
 ('8,000,000.00',)]

In string handling we can use one function within another

In [45]:
%%sql
select
upper(concat(customer_name,'-',address,'-','tn')) as general_details
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('RAVI-CHENNAI-TN',),
 ('PRIYA-BANGALORE-TN',),
 ('ARJUN-HYDERABAD-TN',),
 ('MEENA-MUMBAI-TN',),
 (None,),
 ('NITHESH-CHENNAI-TN',)]

In [46]:
%%sql
select
length(upper(concat(customer_name,'-',address,'-','tn'))) as general_details
from customerdata

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[(15,), (18,), (18,), (15,), (None,), (18,)]

SUB-QURIES
sub-quries are quries within quries , like an nested if condition within condition also we can state sub conditions